Autodesk.Revit.DB.Material.SetMaterialAspectByPropertySet(Autodesk.Revit.DB.MaterialAspect,Autodesk.Revit.DB.ElementId)
Set an aspect of the material to a shared property set.
aspect:
The material aspect.
propertySetId:
Identifier of a shared property set (an instance of PropertySetElement).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Material.Duplicate(System.String)
Duplicates the material
Remarks:
If the name specified contains invalid characters,
or the name has been used by other materials in the project, an ArgumentException will
be thrown. If duplication fails, null will be returned.
name:
Name of the new material.
Returns:
The new material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
The given value for name is already in use as a material element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Material.MaterialCagtegory
The name of the material category, e.g. 'Wood'
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Material.AppearanceAssetId
The ElementId of the AppearanceAssetElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Material.SurfacePatternId
Gets and sets the surface fill pattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.CutPatternId
Gets and sets the cut fill pattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.CutPatternColor
The color of the material cut pattern.
The color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.SurfacePatternColor
The color of the material surface pattern.
The color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.Color
The color of the material.
The color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.Transparency
The transparency of the material.
The value ranges from 0 to 100. If trying to set the value out of the range, ArgumentException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: values for shininess must be between 0 and 128

Autodesk.Revit.DB.Material.Smoothness
The smoothness of the material.
The value ranges from 0 to 100. If trying to set the value out of the range, ArgumentException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: values for shininess must be between 0 and 128

Autodesk.Revit.DB.Material.Shininess
The shininess of the material.
The value ranges from 0 to 100. If trying to set the value out of the range, ArgumentException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: values for shininess must be between 0 and 128

Autodesk.Revit.DB.Material.Glow
Whether the material can glow.
Remarks:
This value is obsolete in Autodesk Revit 2009 due to a similar change in the UI.
True if the material can glow, false if it cannot.

Autodesk.Revit.DB.Material.UseRenderAppearanceForShading
True to use the render appearance settings for shaded view appearance,
false to use the material's color and transparency value for shaded view appearance.
Since:
2015

Autodesk.Revit.DB.Material
Represents a material element within an Autodesk Revit project.
Remarks:
This is the parent class for concrete material subclasses.
Currently, the supported materials are wood, steel, generic, concrete and other.